# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\LAIR\Documents\GitHub\Golfcart\PSOC_PROGRAMS\PSoC5\Roadrunner Control System.cydsn\Roadrunner Control System.cyprj
# Date: Fri, 14 Oct 2016 17:17:33 GMT
#set_units -time ns
create_clock -name {POTADC_theACLK(routed)} -period 628.93081761006283 -waveform {0 314.465408805031} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {DVDAC_IntClock(routed)} -period 3999.9999999999995 -waveform {0 2000} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 12.578616352201257 -waveform {0 6.28930817610063} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 12.578616352201257 -waveform {0 6.28930817610063} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 7} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {POTADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 51 101} -nominal_period 628.93081761006283 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 87 173} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {DVDAC_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 319 637} -nominal_period 3999.9999999999995 [list [get_pins {ClockBlock/dclk_glb_2}]]


# Component constraints for C:\Users\LAIR\Documents\GitHub\Golfcart\PSOC_PROGRAMS\PSoC5\Roadrunner Control System.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\LAIR\Documents\GitHub\Golfcart\PSOC_PROGRAMS\PSoC5\Roadrunner Control System.cydsn\Roadrunner Control System.cyprj
# Date: Fri, 14 Oct 2016 17:17:24 GMT
